{"sections":{"main":{"type":"page-about","disabled":true,"settings":{"heading":"","contents":""}},"gs_image_text_KLjwqq":{"type":"gs-image-text","blocks":{"heading_eKGQD3":{"type":"heading","settings":{"heading":"The story about us"}},"text_kmrrgX":{"type":"text","settings":{"text":"<p><strong>art takes time<\/strong> was born out of a passion for uniqueness and craftsmanship. In an era of mass production and quick profits, we wanted to create a brand that values authenticity and quality. Our collections are intentionally limited, with each item produced in quantities of only 80-120 pieces. This guarantees exclusivity and ensures that each piece is made with meticulous care and attention to detail.<br\/><br\/>We believe in collaboration—not just in business but as a core value of our brand. We work closely with our suppliers, forging relationships that are reflected in the quality and originality of our products. It’s a familial effort, driven by a shared commitment to excellence.More than a fashion brand,<strong> art takes time<\/strong> is a lifestyle. Alongside our clothing collections, we are expanding to include furniture and other lifestyle products. Our goal is to offer a holistic experience rooted in mindfulness, exclusivity, and craftsmanship across all aspects of life.<br\/><br\/>One of the stories that inspired our founder came during a journey through the secluded villages of Japan, where traditional craftsmanship still thrives. There, he learned the value of patience and the dedication required for true artistry. This experience became the foundation for <strong>art takes time <\/strong>— a brand that brings the timeless essence of craftsmanship into the modern world.<\/p><p><\/p><p><strong>art takes time<\/strong> represents a return to craftsmanship, an appreciation of the present moment, and the belief that life is an art form. We invite you to join us on this journey—to slow down, embrace quality, and find inspiration in the art of living.<br\/><br\/><\/p>"}}},"block_order":["heading_eKGQD3","text_kmrrgX"],"settings":{"image":"shopify:\/\/shop_images\/ArtTakesTime_Design_5.jpg","alignment":"3","textAlignment":"center","background":"rgba(0,0,0,0)","color":"#000000"}}},"order":["main","gs_image_text_KLjwqq"]}